zephyrproject-rtos/zephyr/drivers/counter/counter_stm32_rtc.c
/*
 * Copyright (c) 2018 Workaround GmbH
 * Copyright (c) 2018 Allterco Robotics
 * Copyright (c) 2018 Linaro Limited
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Source file for the STM32 RTC driver
 *
 */

#define DT_DRV_COMPAT st_stm32_rtc

#include <time.h>

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_exti_stm32.h>
#include <zephyr/sys/util.h>
#include <zephyr/kernel.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_ll_cortex.h>
#include <stm32_ll_exti.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_rtc.h>
#include <zephyr/drivers/counter.h>
#include <zephyr/sys/timeutil.h>
#include <zephyr/pm/device.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

#include <stm32_backup_domain.h>
#include <stm32_hsem.h>

LOG_MODULE_REGISTER(counter_rtc_stm32, CONFIG_COUNTER_LOG_LEVEL);

#if CONFIG_STM32_HAL2
#define STM32_RTC_HOUR_FORMAT_24HOUR		LL_RTC_HOUR_FORMAT_24HOUR
#define STM32_RTC_HOUR_FORMAT_AMPM		LL_RTC_HOUR_FORMAT_AMPM
#define STM32_RTC_TIME_FORMAT_AM_24H		LL_RTC_TIME_FORMAT_AM_24H
#define STM32_RTC_GET_SECOND			LL_RTC_GET_SECOND
#define STM32_RTC_GET_MINUTE			LL_RTC_GET_MINUTE
#define STM32_RTC_GET_HOUR			LL_RTC_GET_HOUR
#define STM32_RTC_GET_DAY			LL_RTC_GET_DAY
#define STM32_RTC_GET_WEEKDAY			LL_RTC_GET_WEEKDAY
#define STM32_RTC_GET_YEAR			LL_RTC_GET_YEAR
#define STM32_RTC_GET_MONTH			LL_RTC_GET_MONTH
#define STM32_RTC_EnableBypassShadowReg		LL_RTC_EnableBypassShadowReg
#define STM32_RTC_DisableBypassShadowReg	LL_RTC_DisableBypassShadowReg

/* On HAL2 this macro skips the RTC instance as the first argument,
 * only the potential following arguments are passed.
 */
#define STM32_ARG(dev, ...)	__VA_ARGS__
#else /* CONFIG_STM32_HAL2 */
#define STM32_RTC_HOUR_FORMAT_24HOUR		LL_RTC_HOURFORMAT_24HOUR
#define STM32_RTC_HOUR_FORMAT_AMPM		LL_RTC_HOURFORMAT_AMPM
#define STM32_RTC_TIME_FORMAT_AM_24H		LL_RTC_TIME_FORMAT_AM_OR_24
#define STM32_RTC_GET_SECOND			__LL_RTC_GET_SECOND
#define STM32_RTC_GET_MINUTE			__LL_RTC_GET_MINUTE
#define STM32_RTC_GET_HOUR			__LL_RTC_GET_HOUR
#define STM32_RTC_GET_DAY			__LL_RTC_GET_DAY
#define STM32_RTC_GET_WEEKDAY			__LL_RTC_GET_WEEKDAY
#define STM32_RTC_GET_MONTH			__LL_RTC_GET_MONTH
#define STM32_RTC_GET_YEAR			__LL_RTC_GET_YEAR
#define STM32_RTC_EnableBypassShadowReg		LL_RTC_EnableShadowRegBypass
#define STM32_RTC_DisableBypassShadowReg	LL_RTC_DisableShadowRegBypass

/* On HAL1 this macro adds the RTC instance as the first argument,
 * with or without a comma depending on number of arguments.
 */
#define STM32_ARG(dev, ...)	COND_CODE_1(IS_EMPTY(__VA_ARGS__), (dev), (dev, __VA_ARGS__))
#endif /* CONFIG_STM32_HAL2 */

#if defined(CONFIG_SOC_SERIES_STM32F1X) || defined(CONFIG_SOC_SERIES_STM32F2X) || \
	(defined(CONFIG_SOC_SERIES_STM32L1X) && !defined(RTC_SUBSECOND_SUPPORT))
/* subsecond counting is not supported by some STM32L1x MCUs (Cat.1) & by STM32F1x/2x SoC series */
#define HW_SUBSECOND_SUPPORT 0
#else
#define HW_SUBSECOND_SUPPORT 1
#endif

/* Seconds from 1970-01-01T00:00:00 to 2000-01-01T00:00:00 */
#define T_TIME_OFFSET 946684800

#if DT_INST_NODE_HAS_PROP(0, alrm_exti_line)
#define RTC_EXTI_LINE_NUM DT_INST_PROP(0, alrm_exti_line)
#endif /* DT_INST_NODE_HAS_PROP(0, alrm_exti_line) */

#if defined(CONFIG_SOC_SERIES_STM32F1X)
#define COUNTER_NO_DATE
#endif

#if DT_INST_CLOCKS_CELL_BY_IDX(0, 1, bus) == STM32_SRC_LSI
/* LSI */
#define RTCCLK_FREQ STM32_LSI_FREQ
#else
/* LSE */
#define RTCCLK_FREQ STM32_LSE_FREQ
#endif /* DT_INST_CLOCKS_CELL_BY_IDX(0, 1, bus) == STM32_SRC_LSI */

#if !defined(CONFIG_SOC_SERIES_STM32F1X)
#ifndef CONFIG_COUNTER_RTC_STM32_SUBSECONDS
#define RTC_ASYNCPRE BIT_MASK(7)
#else /* !CONFIG_COUNTER_RTC_STM32_SUBSECONDS */
/* Get the highest possible clock for the subsecond register */
#define RTC_ASYNCPRE 1
#endif /* CONFIG_COUNTER_RTC_STM32_SUBSECONDS */
#else /* CONFIG_SOC_SERIES_STM32F1X */
#define RTC_ASYNCPRE (RTCCLK_FREQ - 1)
#endif /* CONFIG_SOC_SERIES_STM32F1X */

/* Timeout in microseconds used to wait for flags */
#define RTC_TIMEOUT 1000

/* Adjust the second sync prescaler to get 1Hz on ck_spre */
#define RTC_SYNCPRE ((RTCCLK_FREQ / (1 + RTC_ASYNCPRE)) - 1)

#ifndef CONFIG_COUNTER_RTC_STM32_SUBSECONDS
typedef uint32_t tick_t;
#else
typedef uint64_t tick_t;
#endif

struct rtc_stm32_config {
	struct counter_config_info counter_info;
	uint32_t async_prescaler;
#if !defined(CONFIG_SOC_SERIES_STM32F1X)
	uint32_t sync_prescaler;
#endif  /* !CONFIG_SOC_SERIES_STM32F1X */
	const struct stm32_pclken *pclken;
#if DT_INST_CLOCKS_CELL_BY_IDX(0, 1, bus) == STM32_SRC_HSE
	uint32_t hse_prescaler;
#endif
};

struct rtc_stm32_data {
	counter_alarm_callback_t callback;
	uint32_t ticks;
	void *user_data;
#ifdef CONFIG_COUNTER_RTC_STM32_SUBSECONDS
	bool irq_on_late;
#endif /* CONFIG_COUNTER_RTC_STM32_SUBSECONDS */
};

static inline void ll_clear_alarm_flag(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_ClearFlag_ALR(STM32_ARG(RTC));
#else
	LL_RTC_ClearFlag_ALRA(STM32_ARG(RTC));
#endif
}

static inline uint32_t ll_is_active_alarm(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	return LL_RTC_IsActiveFlag_ALR(STM32_ARG(RTC));
#else
	return LL_RTC_IsActiveFlag_ALRA(STM32_ARG(RTC));
#endif
}

static inline void ll_enable_interrupt_alarm(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_EnableIT_ALR(STM32_ARG(RTC));
#else
	LL_RTC_EnableIT_ALRA(STM32_ARG(RTC));
#endif
}

static inline void ll_disable_interrupt_alarm(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_DisableIT_ALR(STM32_ARG(RTC));
#else
	LL_RTC_DisableIT_ALRA(STM32_ARG(RTC));
#endif
}

#ifdef CONFIG_COUNTER_RTC_STM32_SUBSECONDS
static inline uint32_t ll_isenabled_interrupt_alarm(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	return LL_RTC_IsEnabledIT_ALR(STM32_ARG(RTC));
#else
	return LL_RTC_IsEnabledIT_ALRA(STM32_ARG(RTC));
#endif
}
#endif /* CONFIG_COUNTER_RTC_STM32_SUBSECONDS */

static inline void ll_enable_alarm(void)
{
#if !defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_ALMA_Enable(STM32_ARG(RTC));
#endif
}

