zephyrproject-rtos/zephyr/drivers/counter/counter_stm32_rtc.c
static inline void ll_disable_alarm(void)
{
#if !defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_ALMA_Disable(STM32_ARG(RTC));
#endif
}

static void rtc_stm32_irq_config(const struct device *dev);

/* When no error occurs, this function disables the RTC write protection and should be balanced
 * with a call to rtc_stm32_exit_init_mode (which enables RTC write protection).
 * In case of error, the write protection is enabled when leaving this function, so nothing more
 * needs to be made.
 */
static int rtc_stm32_enter_init_mode(void)
{
#if defined(CONFIG_SOC_SERIES_STM32F1X)
	/* Wait for RTC to be ready */
	if (!WAIT_FOR(LL_RTC_IsActiveFlag_RTOF(STM32_ARG(RTC)), RTC_TIMEOUT, NULL)) {
		return -ETIMEDOUT;
	}

	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));
#else
	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	/* Check if the Initialization mode is set */
	if (LL_RTC_IsActiveFlag_INIT(STM32_ARG(RTC)) == 0U) {
		/* Set the Initialization mode */
		LL_RTC_EnableInitMode(STM32_ARG(RTC));
		if (!WAIT_FOR(LL_RTC_IsActiveFlag_INIT(STM32_ARG(RTC)), RTC_TIMEOUT, NULL)) {
			LL_RTC_DisableInitMode(STM32_ARG(RTC));
			LL_RTC_EnableWriteProtection(STM32_ARG(RTC));
			return -ETIMEDOUT;
		}
	}
#endif

	return 0;
}

static int rtc_stm32_exit_init_mode(void)
{
	int status = 0;

#if defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));

	/* Wait for RTC to be ready */
	if (!WAIT_FOR(LL_RTC_IsActiveFlag_RTOF(STM32_ARG(RTC)), RTC_TIMEOUT, NULL)) {
		status = -ETIMEDOUT;
	}
#else
	LL_RTC_DisableInitMode(STM32_ARG(RTC));

	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));
#endif

	return status;
}

#if !defined(CONFIG_COUNTER_RTC_STM32_SAVE_VALUE_BETWEEN_RESETS)
static int rtc_stm32_wait_for_synchro(void)
{
	int status = 0;

	/* Clear RSF flag */
	LL_RTC_ClearFlag_RS(STM32_ARG(RTC));

	if (!WAIT_FOR(LL_RTC_IsActiveFlag_RS(STM32_ARG(RTC)), RTC_TIMEOUT, NULL)) {
		status = -ETIMEDOUT;
	}

	return status;
}

static int rtc_stm32_deinit(void)
{
	int ret;

	/* Set Initialization mode */
	ret = rtc_stm32_enter_init_mode();
	if (ret < 0) {
		LOG_ERR("Failed to enter RTC init mode");
		return ret;
	}

#if defined(CONFIG_SOC_SERIES_STM32F1X)
	stm32_reg_write(&RTC->CNTL, 0U);
	stm32_reg_write(&RTC->CNTH, 0U);
	stm32_reg_write(&RTC->PRLH, 0U);
	stm32_reg_write(&RTC->PRLL, 0x8000U);
	stm32_reg_write(&RTC->CRH, 0U);
	stm32_reg_write(&RTC->CRL, 0x20U);
#else /* CONFIG_SOC_SERIES_STM32F1X */
	stm32_reg_write(&RTC->CR, 0U);
	stm32_reg_write(&RTC->TR, 0U);
#ifdef RTC_WUTR_WUT
	stm32_reg_write(&RTC->WUTR, RTC_WUTR_WUT);
#endif /* RTC_WUTR_WUT */
	stm32_reg_write(&RTC->DR, RTC_DR_WDU_0 | RTC_DR_MU_0 | RTC_DR_DU_0);
	stm32_reg_write(&RTC->PRER, RTC_PRER_PREDIV_A | 0xFFU);
	stm32_reg_write(&RTC->ALRMAR, 0U);
#ifdef RTC_CR_ALRBE
	stm32_reg_write(&RTC->ALRMBR, 0U);
#endif /* RTC_CR_ALRBE */

#if HW_SUBSECOND_SUPPORT
	stm32_reg_write(&RTC->CALR, 0U);
	stm32_reg_write(&RTC->SHIFTR, 0U);
	stm32_reg_write(&RTC->ALRMASSR, 0U);
#ifdef RTC_CR_ALRBE
	stm32_reg_write(&RTC->ALRMBSSR, 0U);
#endif /* RTC_CR_ALRBE */
#endif /* HW_SUBSECOND_SUPPORT */

#if defined(RTC_PRIVCFGR_PRIV)
	stm32_reg_write(&RTC->PRIVCFGR, 0U);
#endif /* RTC_PRIVCFGR_PRIV */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
	stm32_reg_write(&RTC->SECCFGR,  0U);
#endif /* (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

	/* Reset I(C)SR register and exit initialization mode */
#ifdef RTC_ICSR_INIT
	stm32_reg_write(&RTC->ICSR, 0U);
#else
	stm32_reg_write(&RTC->ISR, 0U);
#endif

#endif /* CONFIG_SOC_SERIES_STM32F1X */

	/* Exit Initialization mode */
	ret = rtc_stm32_exit_init_mode();
	if (ret < 0) {
		LOG_ERR("Failed to exit RTC init mode");
		return ret;
	}

	return rtc_stm32_wait_for_synchro();
}
#endif

static int rtc_stm32_configure(const struct device *dev)
{
	const struct rtc_stm32_config *cfg = dev->config;
	int ret;

	/* Set Initialization mode */
	ret = rtc_stm32_enter_init_mode();
	if (ret < 0) {
		LOG_ERR("Failed to enter RTC init mode");
		return ret;
	}

#if defined(CONFIG_SOC_SERIES_STM32F1X)
	LL_RTC_SetAsynchPrescaler(STM32_ARG(RTC, cfg->async_prescaler));
	LL_RTC_SetOutputSource(BKP, LL_RTC_CALIB_OUTPUT_NONE);
#else
	LL_RTC_SetHourFormat(STM32_ARG(RTC, STM32_RTC_HOUR_FORMAT_24HOUR));
	LL_RTC_SetAsynchPrescaler(STM32_ARG(RTC, cfg->async_prescaler));
	LL_RTC_SetSynchPrescaler(STM32_ARG(RTC, cfg->sync_prescaler));
#endif

	/* Exit Initialization mode */
	ret = rtc_stm32_exit_init_mode();
	if (ret < 0) {
		LOG_ERR("Failed to exit RTC init mode");
	}

	return ret;
}

static int rtc_stm32_start(const struct device *dev)
{
#if defined(CONFIG_SOC_SERIES_STM32WBAX) || defined(CONFIG_SOC_SERIES_STM32U5X)
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct rtc_stm32_config *cfg = dev->config;

	/* Enable RTC bus clock */
	if (clock_control_on(clk, (clock_control_subsys_t) &cfg->pclken[0]) != 0) {
		LOG_ERR("RTC clock enabling failed");
		return -EIO;
	}
#else
	ARG_UNUSED(dev);

	z_stm32_hsem_lock(CFG_HW_RCC_SEMID, HSEM_LOCK_DEFAULT_RETRY);
	stm32_backup_domain_enable_access();
	LL_RCC_EnableRTC();
	stm32_backup_domain_disable_access();
	z_stm32_hsem_unlock(CFG_HW_RCC_SEMID);
#endif /* CONFIG_SOC_SERIES_STM32WBAX || CONFIG_SOC_SERIES_STM32U5X */

	return 0;
}


static int rtc_stm32_stop(const struct device *dev)
{
#if defined(CONFIG_SOC_SERIES_STM32WBAX) || defined(CONFIG_SOC_SERIES_STM32U5X)
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct rtc_stm32_config *cfg = dev->config;

	/* Disable RTC bus clock */
	if (clock_control_off(clk, (clock_control_subsys_t) &cfg->pclken[0]) != 0) {
		LOG_ERR("RTC clock disabling failed");
		return -EIO;
	}
#else
	ARG_UNUSED(dev);

	z_stm32_hsem_lock(CFG_HW_RCC_SEMID, HSEM_LOCK_DEFAULT_RETRY);
	stm32_backup_domain_enable_access();
	LL_RCC_DisableRTC();
	stm32_backup_domain_disable_access();
	z_stm32_hsem_unlock(CFG_HW_RCC_SEMID);
#endif /* CONFIG_SOC_SERIES_STM32WBAX || CONFIG_SOC_SERIES_STM32U5X */

	return 0;
}

#if !defined(COUNTER_NO_DATE)
tick_t rtc_stm32_read(const struct device *dev)
{
	struct tm now = { 0 };
	time_t ts;
	uint32_t rtc_date, rtc_time;
	tick_t ticks;
#ifdef CONFIG_COUNTER_RTC_STM32_SUBSECONDS
	uint32_t rtc_subsecond;
#endif /* CONFIG_COUNTER_RTC_STM32_SUBSECONDS */
	ARG_UNUSED(dev);

	do {
		/* read date, time and subseconds and relaunch if a day increment occurred
		 * while doing so as it will result in an erroneous result otherwise
		 */
		rtc_date = LL_RTC_DATE_Get(STM32_ARG(RTC));
		do {
			/* read time and subseconds and relaunch if a second increment occurred
			 * while doing so as it will result in an erroneous result otherwise
			 */
			rtc_time = LL_RTC_TIME_Get(STM32_ARG(RTC));
#if CONFIG_COUNTER_RTC_STM32_SUBSECONDS
			do {
				/* read subseconds and relaunch if a second increment occurred
				 * while doing so as it will result in an erroneous result otherwise
				 */
				rtc_subsecond = LL_RTC_TIME_GetSubSecond(STM32_ARG(RTC));
			} while (rtc_subsecond != LL_RTC_TIME_GetSubSecond(STM32_ARG(RTC)));
#endif /* CONFIG_COUNTER_RTC_STM32_SUBSECONDS */
		} while (rtc_time != LL_RTC_TIME_Get(STM32_ARG(RTC)));
	} while (rtc_date != LL_RTC_DATE_Get(STM32_ARG(RTC)));

